{"pageProps":{"game":{"date":"2025-01-28","brand":"Github","orientation":0,"title":"10 Minutes Till Dawn - Play Unblocked","name":["10 Minutes Till Dawn","10-minutes-till-dawn"],"thumb":"/assets/thumb/10-minutes-till-dawn.png","thumb_big":"/assets/thumb/10-minutes-till-dawn.png","path":["/game/10-minutes-till-dawn","https://new-unblocked-games.github.io"],"iframe":"https://classroom6x.gitlab.io/10-minutes-till-dawn/","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Play 10 Minutes Till Dawn, an action-packed bullet-hell roguelite game where you survive and attack enemies for 10 minutes. Available on web browsers and Steam.","l_dis":"\n      <h1>10 Minutes Till Dawn - Survive the Bullet Hell!</h1>\n    <h2 class=\"H22\">What is 10 Minutes Till Dawn?</h2>\n    <p>10 Minutes Till Dawn is an action-packed bullet-hell roguelite game where players must survive relentless enemy attacks for 10 minutes. It is a demo version of the full game, <strong>20 Minutes Till Dawn</strong>, available on Steam.</p>\n    <h2 class=\"H22\">How to Play 10 Minutes Till Dawn</h2>\n    <p>In <strong>10 Minutes Till Dawn</strong>, you control a character who must shoot and eliminate waves of enemies while strategically avoiding attacks. The game challenges players with an intense survival experience, requiring quick reflexes and smart upgrades.</p>\n    <ul>\n        <li><strong>Move:</strong> Use WASD keys to navigate.</li>\n        <li><strong>Shoot:</strong> Left-click to attack enemies.</li>\n        <li><strong>Survive:</strong> Last for 10 minutes against endless waves of monsters.</li>\n        <li><strong>Upgrade:</strong> Collect XP to unlock powerful abilities and weapons.</li>\n    </ul>\n    <h2 class=\"H22\">10 Minutes Till Dawn Unblocked - Play Anywhere</h2>\n    <p>Looking to play <strong>10 Minutes Till Dawn Unblocked</strong>? Many gaming sites offer an unblocked version, allowing players to enjoy the game without restrictions. Simply search for “10 Minutes Till Dawn Unblocked” to find a website hosting the game.</p>\n    <h2 class=\"H22\">Why Play 10 Minutes Till Dawn?</h2>\n    <p>The game’s fast-paced action, strategic upgrades, and immersive gameplay make it a must-play for fans of roguelite and bullet-hell games. It’s perfect for quick gaming sessions and offers a taste of the full experience available in <strong>20 Minutes Till Dawn</strong>.</p>\n    <h2 class=\"H22\">Where to Play 10 Minutes Till Dawn?</h2>\n    <p>You can play <strong>10 Minutes Till Dawn</strong> on:</p>\n    <ul>\n        <li><strong>Web Browser:</strong> Play instantly online.</li>\n        <li><strong>Steam:</strong> Download and experience the full version, <strong>20 Minutes Till Dawn</strong>.</li>\n    </ul>\n    <h2 class=\"H22\">Final Thoughts</h2>\n    <p>Whether you’re a fan of roguelite games or just looking for a thrilling challenge, <strong>10 Minutes Till Dawn</strong> is a fantastic choice. If you want to unlock the full potential of the game, consider getting <strong>20 Minutes Till Dawn</strong> on Steam.</p>\n\n      ","tag":["Survival","Shooting","Action"],"rating":[4.8,15102,1014]}},"__N_SSG":true}